let
    @test get(q"12h34m56.78s","rad") ≈ π/12.*(12.+34/60.+56.78/3600)
    @test get(q"12h34m56s","rad")    ≈ π/12.*(12.+34/60.+56./3600)
    @test get(q"12h34.56m","rad")    ≈ π/12.*(12.+34.56/60.)
    @test get(q"12h34m","rad")       ≈ π/12.*(12.+34./60.)
    @test get(q"12.34h","rad")       ≈ π/12.*(12.34)
    @test get(q"12h","rad")          ≈ π/12.*(12.)

    @test get(q"12d34m56.78s","rad")   ≈ π/180.*(12.+34/60.+56.78/3600)
    @test get(q"12d34m56s","rad")      ≈ π/180.*(12.+34/60.+56./3600)
    @test get(q"12d34.56m","rad")      ≈ π/180.*(12.+34.56/60.)
    @test get(q"12d34m","rad")         ≈ π/180.*(12.+34./60.)
    @test get(q"12.34d","rad")         ≈ π/180.*(12.34)
    @test get(q"12d","rad")            ≈ π/180.*(12.)
    @test get(q"+12d34m56.78s","rad")  ≈ π/180.*(12.+34/60.+56.78/3600)
    @test get(q"+12d34m56s","rad")     ≈ π/180.*(12.+34/60.+56./3600)
    @test get(q"+12d34.56m","rad")     ≈ π/180.*(12.+34.56/60.)
    @test get(q"+12d34m","rad")        ≈ π/180.*(12.+34./60.)
    @test get(q"+12.34d","rad")        ≈ π/180.*(12.34)
    @test get(q"+12d","rad")           ≈ π/180.*(12.)
    @test get(q"-12d34m56.78s","rad")  ≈ -1*π/180.*(12.+34/60.+56.78/3600)
    @test get(q"-12d34m56s","rad")     ≈ -1*π/180.*(12.+34/60.+56./3600)
    @test get(q"-12d34.56m","rad")     ≈ -1*π/180.*(12.+34.56/60.)
    @test get(q"-12d34m","rad")        ≈ -1*π/180.*(12.+34./60.)
    @test get(q"-12.34d","rad")        ≈ -1*π/180.*(12.34)
    @test get(q"-12d","rad")           ≈ -1*π/180.*(12.)
end

let
    meter = Unit("m")
    @test get(q"1.0m",meter) == 1.0
    @test get(q"1m",meter) == 1.0
    @test get(q"1.0m","m") == 1.0
    @test get(q"1m","m") == 1.0
end

